minimal.el
(add-to-list 'load-path (concat user-emacs-directory "modules/"))

(require 'startup-performance-setup)

(require 'package-management-setup)

(require 'skeletons-setup)

(require 'custom-functions-setup)

(require 'useful-defaults-setup)

(require 'theme-setup)

(require 'autosave-setup)

(require 'files-navigation-setup)

(require 'openwith-setup)

(require 'undo-tree-setup)

(require 'org-export-backends-setup)

(require 'skeletons-setup)

(require 'org-mode-setup)

(require 'org-roam-setup)

(require 'org-remark-setup)

(require 'citar-setup)

(require 'epresent-setup)

(require 'ctags-setup)

(require 'company-setup)

(require 'lsp-setup)

(require 'vterm-setup)
